app/controllers/school_classes_controller.rb

  def create
    @student=SchoolClass.create(sc_params)
---
INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "asd"], ["room_number", 0], ["created_at", "2019-06-30 02:36:16.189102"], ["updated_at", "2019-06-30 02:36:16.189102"]]

  def edit
    @sc=SchoolClass.find(params[:id])
---
SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def show
    @sc=SchoolClass.find(params[:id])
---
SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

  def update
    @sc=SchoolClass.find(params[:id])
    @sc.update(sc_params)
---
SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "school_classes" SET "title" = ?, "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["title", "asd"], ["room_number", 56], ["updated_at", "2019-06-30 03:04:17.280241"], ["id", 2]]