app/controllers/students_controller.rb

  def create
    @student=Student.create(sc_params)
---
INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "AA"], ["last_name", "BB"], ["created_at", "2019-06-28 18:32:12.847755"], ["updated_at", "2019-06-28 18:32:12.847755"]]

  def update
  @student=Student.find(params[:id])
  @student.update(sc_params)
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "students" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Lindsey"], ["last_name", "Stirling"], ["updated_at", "2019-06-28 18:36:59.378792"], ["id", 1]]